//---------------------------------------------------------------------------//
//
// Twitter.h
//  Twitter 関連の関数
//   Copyright (C) 2014 tapetums
//
//---------------------------------------------------------------------------//

#pragma once

//---------------------------------------------------------------------------//
// Twitter 関連の関数
//---------------------------------------------------------------------------//

bool __stdcall Tweet
(
    HWND hwnd, size_t index, LPCTSTR username, LPCTSTR message
);

//---------------------------------------------------------------------------//

bool __stdcall UploadPicture
(
    LPCTSTR filename, LPTSTR uploadedURL, int nMaxLength
);

//---------------------------------------------------------------------------//

bool __stdcall ShortenURL
(
    LPCTSTR URL, LPTSTR shortenedURL, int nMaxLength
);

//---------------------------------------------------------------------------//

// Twitter.h